.config/emacs-configs/doom-config/config.org
#+filetags: :test: :temp:
#+title: DOOM Emacs Configuration
#+property: header-args:emacs-lisp :tangle config.el

This is my DOOM Emacs configuration. Using DOOM Emacs wasn't my first choice,
I'd rather use a custom or at least more minimal configuration. There is a lot
of things here that I don't exactly think that I need. I am only interested in
Emacs for org mode and Emacs lisp mode (which is of course required for doing
anything in Emacs). I have tried several times to create such a configuration,
but so far I have not been able to create one which is as clean as DOOM Emacs
(which is an unrealistic goal I know) or even functional. My latest attempt
was definitely my best one, but has this weird problem where the org mode
source blocks would not follow correct indentation and (this is the real problem)
hitting ~<return>~ at the end of the last line of such a block would not create a
new line. It just did /nothing/.

That was during the second day of configuring stuff. I searched for hours for a
solution and tried several of them, but was not able to find any. Because of
that, I was back to DOOM Emacs which at least works out of the box which being
/too/ fiddly. It quickly lets me work on the things that I am actually interested in,
creating a powerful note-taking and task management system, but one day I will try
to do back to a completely custom configuration when my Emacs Lisp skills improve.

Let's get started.

The default =config.el= file as a lot of comments with little substance, but I would
still like to preserve it just in case.

* User Information
#+begin_src emacs-lisp
;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-

;; Place your private configuration here! Remember, you do not need to run 'doom
;; sync' after modifying this file!


;; Some functionality uses this to identify you, e.g. GPG configuration, email
;; clients, file templates and snippets. It is optional.
(setq user-full-name "Matt Schwennesen"
      user-mail-address "mjschwenne@gmail.com")
#+end_src

* Visuals
** Font Configuration

#+begin_src emacs-lisp
;;; Doom exposes five (optional) variables for controlling fonts in Doom:
;;
;; - `doom-font' -- the primary font to use
;; - `doom-variable-pitch-font' -- a non-monospace font (where applicable)
;; - `doom-big-font' -- used for `doom-big-font-mode'; use this for
;;   presentations or streaming.
;; - `doom-unicode-font' -- for unicode glyphs
;; - `doom-serif-font' -- for the `fixed-pitch-serif' face
;;
;; See 'C-h v doom-font' for documentation and more examples of what they
;; accept. For example:
;;
;;(setq doom-font (font-spec :family "Fira Code" :size 12 :weight 'semi-light)
;;      doom-variable-pitch-font (font-spec :family "Fira Sans" :size 13))
;;
;; If you or Emacs can't find your font, use 'M-x describe-font' to look them
;; up, `M-x eval-region' to execute elisp code, and 'M-x doom/reload-font' to
;; refresh your font settings. If Emacs still can't find your font, it likely
;; wasn't installed correctly. Font issues are rarely Doom issues!

(if (string= system-name "mjs-surface")
    (setq doom-font (font-spec :family "JetBrainsMono Nerd Font" :size 25 :weight 'light))
  (setq doom-font (font-spec :family "JetBrainsMono Nerd Font" :size 15 :weight 'light)))
#+end_src

** Theme

Normally I'd use the Catppuccin theme for everything, but the Catppuccin theme for
Emacs just doesn't look quite right to me, so I'm using my back-up option which is
Tokyo Night.

#+begin_src emacs-lisp
;; There are two ways to load a theme. Both assume the theme is installed and
;; available. You can either set `doom-theme' or manually load a theme with the
;; `load-theme' function. This is the default:
;;(setq doom-theme 'doom-one)
(load-theme 'doom-tokyo-night t)

;;(use-package! autothemer
;;  :ensure t)

;;(load-theme 'catppuccin-mocha t)

;;(set-face-underline 'link t)
;;(custom-theme-set-faces 'catppuccin-mocha
;;                      '(org-block ((t (:background "#181825"))))
;;                       '(org-block-begin-line ((t (:background "#181825" :foreground "#7f849c"))))
;;                       '(org-block-end-line ((t (:background "#181825" :foreground "#7f849c"))))
;;                       '(evil-goggles-default-face ((t (:background "#313244" :extend t)))))

;; Transparency
(set-frame-parameter (selected-frame) 'alpha '(80 . 80))
(add-to-list 'default-frame-alist '(alpha . (80 . 80)))
#+end_src

** Line Numbers

#+begin_src emacs-lisp
;; This determines the style of line numbers in effect. If set to `nil', line
;; numbers are disabled. For relative line numbers, set this to `relative'.
(setq display-line-numbers-type t)
#+end_src

* Keybindings

** Evil

I have been using vim and neovim for about a year and while I still have a lot
to learn about those editors, I've found that even rudimentary knowledge about
their fantastic keybindings in enough to make me an Evil user here in Emacs.
However, I've made some changes in my configuration over here that I'd like to
have here as well.

#+begin_src emacs-lisp
(map! :n "C-h" #'evil-window-left
      :n "C-j" #'evil-window-down
      :n "C-k" #'evil-window-up
      :n "C-l" #'evil-window-right)

; Make evil-snipe search the whole buffer by default
(customize-set-variable 'evil-snipe-scope 'buffer)
(customize-set-variable 'evil-want-C-u-scroll nil)
#+end_src

* Package Configuration

#+begin_src emacs-lisp
;; Whenever you reconfigure a package, make sure to wrap your config in an
;; `after!' block, otherwise Doom's defaults may override your settings. E.g.
;;
;;   (after! PACKAGE
;;     (setq x y))
;;
;; The exceptions to this rule:
;;
;;   - Setting file/directory variables (like `org-directory')
;;   - Setting variables which explicitly tell you to set them before their
;;     package is loaded (see 'C-h v VARIABLE' to look up their documentation).
;;   - Setting doom variables (which start with 'doom-' or '+').
;;
;; Here are some additional functions/macros that will help you configure Doom.
;;
;; - `load!' for loading external *.el files relative to this one
;; - `use-package!' for configuring packages
;; - `after!' for running code after a package has loaded
;; - `add-load-path!' for adding directories to the `load-path', relative to
;;   this file. Emacs searches the `load-path' when you load packages with
;;   `require' or `use-package'.
;; - `map!' for binding new keys
;;
;; To get information about any of these functions/macros, move the cursor over
;; the highlighted symbol at press 'K' (non-evil users must press 'C-c c k').
;; This will open documentation for it, including demos of how they are used.
;; Alternatively, use `C-h o' to look up a symbol (functions, variables, faces,
;; etc).
;;
;; You can also try 'gd' (or 'C-c c d') to jump to their definition and see how
;; they are implemented.
#+end_src

