.doom.d/config.el

;; If you use `org' and don't want your org files in the default location below,
;; change `org-directory'. It must be set before org loads!
(setq org-directory "~/org/")

(add-hook 'org-mode-hook 'auto-fill-mode)
;; Image previewing in org mode
(customize-set-variable 'org-startup-with-inline-images t)
;; Normally, this would be set with `customize-set-variable`, but DOOM Emacs has a function
;; which is loaded as part of their org initialization which overrides this variable.
;; While I could change that, I want to be able to pull the DOOM repo without issue so
;; I'm using advice to update that value after anytime the function in question is called.
(advice-add '+org-init-appearance-h :after (lambda () (customize-set-variable 'org-image-actual-width '(600))))

(setq org-agenda-start-with-log-mode t)
;; Log the time a task is completed in a property drawer.
(setq org-log-done 'time)
(setq org-log-into-drawer t)

(advice-add 'org-refile :after 'org-save-all-org-buffers) ;; Save the buffers after refile

(customize-set-variable 'org-agenda-files '("~/org/tasks/"))

(customize-set-variable 'org-agenda-custom-commands
                        '(("d" "Daily Schedule"
                          ((agenda ""
                                   ((org-agenda-span 'day)
                                    (org-agenda-use-time-grid nil)
                                    (org-agenda-skip-function '(org-agenda-skip-entry-if 'scheduled 'deadline))))))))

(org-babel-do-load-languages
 'org-babel-load-languages
 '((C . t)
   (cpp . t)
   (emacs-lisp . t)
   (latex . t)
   (python . t)
   (R . t)))

(require 'org-tempo)
;; There should be a better way to do this, but I haven't found it yet
(add-to-list 'org-structure-template-alist '("sC" . "src C"))
(add-to-list 'org-structure-template-alist '("scpp" . "src cpp"))
(add-to-list 'org-structure-template-alist '("sel" . "src emacs-lisp"))
(add-to-list 'org-structure-template-alist '("sl" . "src latex"))
(add-to-list 'org-structure-template-alist '("spy" . "src python"))
(add-to-list 'org-structure-template-alist '("sR" . "src R"))

(map! :map org-capture-map
      :leader
      :prefix ("C" . "Capture")
      :desc "Finsh Capture" :n "f" #'org-capture-finalize
      :desc "Abort Capture" :n "k" #'org-capture-kill
      :desc "Refile Capture" :n "r" #'org-capture-refile)

;; DOOM already modifies the header line to add the target file to the header line.
;; This function is ripped from that with the addition of the `concat' portion which I
;; wrote.
(defun mjs/org-capture-update-header ()
  (setq header-line-format
        (format "%s%s%s"
                (propertize (abbreviate-file-name (buffer-file-name (buffer-base-buffer)))
                                'face 'font-lock-string-face)
                org-eldoc-breadcrumb-separator
                (concat
                 "Capture Buffer. Finish "
                 (propertize "SPC C f" 'face 'help-key-binding)
                 ", refile "
                 (propertize "SPC C r" 'face 'help-key-binding)
                 ", abort "
                 (propertize "SPC C k" 'face 'help-key-binding)
                 " in normal mode."
                 ))))

(advice-add '+org-show-target-in-capture-header-h :override 'mjs/org-capture-update-header)

(use-package! org-appear
  :config (custom-set-variables '(org-hide-emphasis-markers t)
                                '(org-appear-autolinks t)
                                '(org-appear-trigger 'manual))
  :hook (org-mode . (lambda ()
                       (org-appear-mode t)
                       (add-hook 'evil-insert-state-entry-hook
                                 #'org-appear-manual-start nil t)
                       (add-hook 'evil-insert-state-exit-hook
                                 #'org-appear-manual-stop nil t)))
  )

(setq langtool-language-tool-jar "/home/mjs/.local/share/nvim/site/pack/packer/start/vim-grammarous/misc/LanguageTool-5.9/languagetool-commandline.jar")
(require 'langtool)
