.config/emacs-configs/doom-config/config.el

(customize-set-variable 'org-startup-with-latex-preview t)

(use-package! org-fragtog
 :hook (org-mode . (lambda ()
                     (add-hook 'evil-insert-state-entry-hook (lambda ()
                                                               (when (eq major-mode 'org-mode)
                                                                 (org-fragtog-mode +1))))
                     (add-hook 'evil-insert-state-exit-hook (lambda ()
                                                              (when (eq major-mode 'org-mode)
                                                                (progn
                                                                  (org-fragtog-mode -1)
                                                                  (if (org-inside-LaTeX-fragment-p) (org-latex-preview))))))))
)

;; Org-roam settings are directory local variables set for various directory similar to
;; Obsidian vaults.
(setq org-roam-directory org-directory)
(setq org-roam-dailies-directory (concat org-roam-directory "/dailies/"))
(setq org-roam-dailies-capture-templates
      (let ((head
             (concat "#+title: %<%Y-%m-%d (%A)>\n#+startup: showall\n* Daily Overview\n"
                     "#+begin_src emacs-lisp :results value raw\n"
                     "(mjs/get-daily-agenda \"%<%Y-%m-%d>\")\n"
                     "#+end_src\n"
                     "* [/] Do Today\n* [/] Possibly Today\n* Journal\n")))
        `(("j" "journal" entry
           "* %<%H:%M> %?"
           :if-new (file+head+olp "%<%Y-%m-%d>.org" ,head ("Journal")))
          ("t" "do today" item
           "[ ] %a"
           :if-new (file+head+olp "%<%Y-%m-%d>.org" ,head ("Do Today"))
           :immediate-finish t)
          ("m" "possibly today" item
           "[ ] %a"
           :if-new (file+head+olp "%<%Y-%m-%d>.org" ,head ("Possibly Today"))
           :immediate-finish t))))

(add-to-list 'org-capture-templates
             `("s" "Great Basin Session Record" plain
               (file ,(format "%s03-TTRPG/pathfinder/Sessions/great-basin-%s.org"
                             org-directory
                             (org-read-date nil nil "Sun")))
               ,(concat "#+title: Great Basin Session (" (org-read-date nil nil "Sun")
                        ")\n#+date: " (org-read-date nil nil "Sun") "\n"
                        "#+filetags: :session:\n\n")
               :immediate-finish t
               :jump-to-captured t))

(add-hook 'org-capture-mode-hook #'org-id-get-create)

(defun mjs/create-class-note ()
  (interactive)
  (let ((class (completing-read "Class: "
                                '("cs1121" "cs2321" "cs3411" "cs5311" )))
        (buffer (get-buffer-create "Lecture Notes")))
    (set-buffer buffer)
    (insert (concat "#+filetags: " class "\n#+title: " class
                    " (" (format-time-string "%d %B %Y" (current-time)) ")\n"
                    "#+author: Matt Schwennesen\n\n"))
    (write-file (concat org-directory "01-classes/" class "/"
                        (format-time-string "%Y-%m-%d" (current-time)) "-" class ".org"))
    (org-id-get-create)
    (switch-to-buffer buffer)))

(defun mjs/strip-org-roam-links ()
  (interactive)
  (save-excursion
    (goto-char (point-min))
    (while (re-search-forward "\\[\\[id:[^]]*\\]\\[\\([^]]*\\)\\]\\]" nil t)
      (progn
        (message "Match detected")
        (replace-match "\\1" nil nil)))
    ))

(defun mjs/org-refile-dwim (target)
  (interactive "FDestination File: \n")
  (unless (org-at-heading-p)
    (error "Point not at org heading! Aborting"))
  (if (file-exists-p target)
      (org-refile nil nil target) ;; File does exist, use regular `org-refile'
    (let ((org-tags (map 'list #'substring-no-properties (org-get-tags)))
          (org-heading (substring-no-properties (org-get-heading)))
          (new-node-id nil)
          (old-buf (current-buffer))
          (new-buf (get-buffer-create (file-name-nondirectory target))))
      (org-copy-subtree nil 'cut)
      (switch-to-buffer new-buf)
      (when org-tags ; Insert tags when then exist
        (insert "#+filetags: ")
        (dolist (tag org-tags)
          (insert (concat ":" tag ": ")))
        (insert "\n"))
      (insert (concat "#+title: " org-heading "\n\n"))
      (write-file target) ; org-roam can only create ids for buffers visiting a file
      (org-id-get-create)
      (setq new-node-id (org-roam-id-at-point))
      (org-paste-subtree)
      (kill-whole-line 2) ; Assumed format is heading followed by blank line
      (org-next-visible-heading 1)
      (when (org-at-heading-p) ; If there is another heading, promote it to first level
        (while (not (eql 1 (nth 0 (org-heading-components))))
          (org-promote-subtree)))
      (goto-char (point-min))
      (write-file target)
      (with-current-buffer old-buf
        (insert (concat "[[id:" new-node-id "][" org-heading "]]\n\n")))
      )))

(map! :map doom-leader-map
      "l" #'mjs/create-class-note)

;; Turn off link completeion everywhere
(setq org-roam-completion-everywhere nil)
;; Make a quick, easy to access keybinding to insert a link with roam
(map! :map org-mode-map
      :i "C-f" #'org-roam-node-insert
      "C-S-f" #'org-insert-link)
