.config/emacs-configs/doom-config/config.el

(defun mjs/toggle-and-mark-done ()
  "Toggle the current checkbox, follow the link under point and mark it as done"
  (interactive)
  (org-toggle-checkbox)
  (org-open-at-point)
  (org-todo 'done))

(map! :map org-mode-map
      :leader
      :localleader
      :prefix ("r" . "roam")
      :desc "Mark Daily Complete" :n "x" #'mjs/toggle-and-mark-done)

(defun mjs/get-daily-agenda (&optional date)
  "Return the agenda for requested day as a string"
  (interactive)
  (let ((file (make-temp-file "daily-agenda" nil ".txt")))
    (org-agenda nil "d" nil)
    (when date (org-agenda-goto-date date))
    (org-agenda-write file nil nil "*Org Agenda*")
    (kill-buffer)
    (with-temp-buffer
      (insert-file-contents file)
      (goto-char (point-min))
      (kill-line 2)
      (while (re-search-forward "^  " nil t)
        (replace-match "- " nil nil))
      (buffer-string))))

(defun mjs/org-roam-make-agenda-link ()
  (interactive)
  (let* ((marker (or (org-get-at-bol 'org-marker)
                     (org-agenda-error)))
         (buffer (marker-buffer marker))
         (pos (marker-position marker)))
    (with-current-buffer buffer
      (save-excursion
        (goto-char pos)
        (org-roam-dailies-capture-today)))))

(map! :map org-agenda-mode-map
      :leader
      :localleader
      :desc "Perform a task Today" :n "t" #'mjs/org-roam-make-agenda-link)

(use-package! vulpea
  :hook ((org-roam-db-autosync-mode . vulpea-db-autosync-mode)))

(use-package! olivetti-mode
  :init (setq olivetti-body-width 100)
  :hook org-mode)

(use-package! org-transclusion
  :after org)

(map! :map org-mode-map
      :leader
      :localleader
      :prefix ("u" . "transclusions")
      :desc "Add Transclusion" :n "a" #'org-transclusion-add
      :desc "Activate All Transclusions" :n "u" #'org-transclusion-mode
      :desc "Remove Transclusion" :n "r" #'org-transclusion-remove)

(defun mjs/search-org-files (query)
  "Return a list of files in the org directory containing QUERY"
  (split-string
   (shell-command-to-string (format "rg \"%s\" %s" query org-directory))
   ":.*\n" t))

(defun mjs/move-and-update-file-links (source-file dest-dir &optional search-dir)
  "Move SOURCE-FILE to DEST-DIR, updating all org file links in SEARCH-DIR"
    (interactive "fSource File: \nDDestination Directory: \n")
    (let* ((search-dir (if (stringp search-dir) search-dir org-directory))
           (source-file-name (file-name-nondirectory source-file))
           (dest-file (file-name-concat dest-dir source-file-name))
           (file-regexp
            (format
             "\\[\\[\\(file\\|pdf\\):\\([^]:]*%s\\)\\(::[0-9]+\\)?\\]\\[\\([^]]*\\)\\]\\]"
                             source-file-name)))

      (rename-file source-file dest-file t)
      ; Iterate over all files in the search directory referencing the source file
      (dolist (file (mjs/search-org-files source-file-name))
        (with-current-buffer (find-file-noselect file) ; Open that file as a buffer
        ;; Here is where the find and replace can happen
        (let ((relative-dest-file (file-relative-name dest-file
                                                      (file-name-directory file))))
          (message (concat "Searching with: " file-regexp))
          (goto-char (point-min))
          (while (re-search-forward file-regexp nil t)
            (replace-match relative-dest-file nil nil nil 2)
            )
        (save-buffer)
        ))
      )))

(defun mjs/move-dir-update-file-links (source-dir dest-dir &optional search-dir)
  "Move SOURCE-DIR into DEST-DIR, updating all file links in SEARCH-DIR referencing files in SOURCE-DIR"
  (interactive "DSource Directory: \nDDestination Directory: \n")
  (let ((search-dir (if (stringp search-dir) search-dir org-directory))
        (dest-file-base (file-name-concat dest-dir
                                          (file-name-nondirectory
                                           (directory-file-name source-dir)))))
    (dolist (file (directory-files-recursively source-dir ".*"))
      (let ((dest-file-dir (expand-file-name
                            (file-relative-name (file-name-directory file) source-dir)
                            dest-file-base)))
        (unless (file-directory-p dest-file-dir)
          (make-directory dest-file-dir))
        (mjs/move-and-update-file-links file dest-file-dir search-dir)
      ))
    (delete-directory source-dir)
  ))

(defun mjs/regenerate-file-links (src &optional search-dir kill)
  "Regenerate file links in SRC org file by searching SEARCH-DIR and updating file paths"
  (interactive (list (current-buffer)))
  (let* ((search-dir (if (stringp search-dir) search-dir org-directory))
         (src-buf (cond
               ((bufferp src) src)
               ((stringp src) (find-file-noselect src)) ; Assume this is a filename
               (t (current-buffer))))
         (src-file (buffer-file-name src-buf))
         (file-link-regexp
          "\\[\\[\\(file\\|pdf\\):\\([^]:]*\\)\\(::[0-9]+\\)?\\]\\(\\[[^]]*\\]\\)\\]"))
    (with-current-buffer src-buf
      (save-excursion (goto-char (point-min)) ; Move the point to start of buffer
                      (while (re-search-forward file-link-regexp nil t)
                        (let ((rel-dest-file (string-trim (file-relative-name
                                                           (shell-command-to-string
                                                            (format "find %s -name \"%s\""
                                                                    search-dir
                                                                    (file-name-nondirectory
                                                                     (match-string 2))))
                                                           (file-name-directory src-file)))))
                          (replace-match rel-dest-file nil nil nil 2) ; Replace only the file path
                          ))
                      (save-buffer)
                      ))
    (when kill (kill-buffer src-buf))
    ))

(defun mjs/regenerate-file-links-globally (&optional dir)
  (interactive "DDirectory: \n")
  (let ((dir (if (stringp dir) dir org-directory)))
    (dolist (file (directory-files-recursively dir ".*\\.org"))
      (mjs/regenerate-file-links file nil 'kill)
    )
))
